package com.metacrew.pr2s.entity.enums;

public enum SidoSigungu {
    SEOUL("서울특별시", new String[]{"서울특별시", "종로구", "중구", "용산구", "성동구", "광진구", "동대문구", "중랑구", "성북구"
            , "강북구", "도봉구", "노원구", "은평구", "서대문구", "마포구", "양천구", "강서구", "구로구", "금천구", "영등포구", "동작구"
            , "관악구", "서초구", "강남구", "송파구", "강동구"})

    , BUSAN("부산광역시", new String[]{"부산광역시", "중구", "서구", "동구", "영도구", "부산진구", "동래구", "남구", "북구"
            , "해운대구", "사하구", "금정구", "강서구", "연제구", "수영구", "사상구", "기장군"})

    , DAEGU("대구광역시", new String[]{"대구광역시", "중구", "동구", "서구", "남구", "북구", "수성구", "달서구", "달성군"})

    , INCHEON("인천광역시", new String[]{"인천광역시", "중구", "동구", "남구", "연수구", "남동구", "부평구", "계양구", "서구"
            , "강화군", "옹진군"})

    , GWANGJU("광주광역시", new String[]{"광주광역시", "동구", "서구", "남구", "북구", "광산구"})

    , DAEJEON("대전광역시", new String[]{"대전광역시", "동구", "중구", "서구", "유성구", "대덕구"})

    , ULSAN("울산광역시", new String[]{"울산광역시", "중구", "남구", "동구", "북구", "울주군"})

    , GYEONGGI("경기도", new String[]{"경기도", "수원시", "수원시장안구", "수원시권선구", "수원시팔달구", "성남시", "성남시수정구"
            , "성남시중원구", "성남시분당구", "의정부시", "안양시", "안양시만안구", "안양시동안구", "부천시", "부천시원미구", "부천시소사구"
            , "부천시오정구", "광명시", "평택시", "동두천시", "안산시", "고양시", "고양시덕양구", "고양시일산구", "과천시", "구리시"
            , "남양주시", "오산시", "시흥시", "군포시", "의왕시", "하남시", "용인시", "파주시", "이천시", "안성시", "김포시", "양주군"
            , "여주군", "화성시", "광주시", "연천군", "포천군", "가평군", "양평군"})

    , GANGWONDO("강원도", new String[]{"강원도", "춘천시", "원주시", "강릉시", "동해시", "태백시", "속초시", "삼척시", "홍천군"
            , "횡성군", "영월군", "평창군", "정선군", "철원군", "화천군", "양구군", "인제군", "고성군", "양양군 "})

    , CHUNGBUK("충청북도", new String[]{"충청북도", "청주시", "청주시상당구", "청주시흥덕구", "충주시", "제천시", "청원군"
            , "보은군", "옥천군", "영동군", "진천군 ", "괴산군", "음성군", "단양군"})

    , CHUNGNAM("충청남도", new String[]{"충청남도", "천안시", "공주시", "보령시", "아산시", "서산시", "논산시", "금산군"
            , "연기군", "부여군" , "서천군", "청양군", "홍성군", "예산군", "태안군", "당진군"})

    , JUNBUK("전라북도", new String[]{"전라북도", "전주시", "전주시완산구", "전주시덕진구", "군산시", "익산시", "정읍시"
            , "남원시", "김제시", "완주군", "진안군", "무주군", "장수군", "임실군", "순창군", "고창군", "부안군"})

    , JUNNAM("전라남도", new String[]{"전라남도", "목포시", "여수시", "순천시", "나주시", "광양시", "담양군", "곡성군"
            , "구례군", "고흥군", "보성군", "화순군", "장흥군", "강진군", "해남군", "영암군", "무안군", "함평군", "영광군", "장성군"
            , "완도군", "진도군", "신안군"});
    SidoSigungu(String sidoNm, String[] sigunguNm){
        this.sidoNm = sidoNm;
        this.sigunguNm = sigunguNm;
    }
    private final String sidoNm;
    private final String[] sigunguNm;
}
